ergasia5/ergasia5soap/src/main/resources/requestWithdraw.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:withdrawAmountRequest>
            <gs:customerName>Customer 1</gs:customerName>
            <gs:amount>50.0</gs:amount>
        </gs:withdrawAmountRequest>
    </soapenv:Body>
</soapenv:Envelope>